Tekla.Structures.Internal.StructuresDataStorage
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresDataStorage.DEFAULT_VALUE
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresDataStorage.#ctor
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresDataStorage.GetVariables(System.String[])
DO NOT USE! For internal usage only!
names:
Returns:

Tekla.Structures.Internal.StructuresDataStorage.GetVariables
DO NOT USE! For internal usage only!
This is a temporary hack that gives direct manipulation API access to current values for .NET Plugins.
The functionality should be re-written and moved to Tekla.Structures.Dialog (from Plugins)
when we need to extend it in any way.
Returns: A dictionary containing the variables and their values.

Tekla.Structures.Internal.StructuresDataStorage.GetVariable(System.String)
DO NOT USE! For internal usage only!
name:
Returns: